---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessGranted
source: html/e691bb52-66a1-96fd-274d-8ae3f30e5c0c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessGranted Method

Checks whether Entities of this Schema may be retrieved by the current add-in.

## Syntax (C#)
```csharp
public bool ReadAccessGranted()
```

## Returns
True if read access is allowed.